Repository: common-repository/addsearch-instant-search
Catalog: languages/addsearch-*.po
Languages: fi

source: AddSearch Instant Search
fi: Nopea AddSearch-haku

source: AddSearch is an instant site search engine for your website.
fi: AddSearch on nopea hakukone sivuillesi, jossa näet hakutulokset välittömästi.

source: Settings
fi: Asetukset

source: Enter AddSearch Site Key in %ssettings%s page to enable AddSearch.
fi: Kirjoita AddSearch avainkoodi %sasetukset%s-sivulla, jotta AddSearch-haku toimii.

source: AddSearch settings
fi: AddSearch-asetukset

source: AddSearch Settings
fi: AddSearch-asetukset

source: Your Site Key
fi: Sivuston avainkoodi

# %s stands for function get_search_form()
source: Enter your Site Key. This will replace all search forms in your site with AddSearch. This means all instances off %s.
fi: Syötä tilisi avainkoodi (public key). Haku korvaa kaikki sivustosi hakulomakkeet AddSearchilla. Tämä tarkoittaa kohtia joissa kutsutaan %s:ia.

source: Installation method
fi: Haun toimintatapa

source: Search as you type (Widget view)
fi: Hae kirjoittaessa (widget-näkymä)

source: Separate page for results
fi: Erillinen hakutulossivu

source: Select whether you want to have results as you type, or a separate page for results.
fi: Valitse haun toimintatapa - hae kirjoittaessa -widget, tai erillinen hakutulossivu.

source: About AddSearch
fi: Tietoa AddSearch-lisäosasta

source: Go to <a href="%s" target="_blank">www.addsearch.com</a> and sign up with your WordPress website address and e-mail.
fi: Mene osoitteeseen <a href="%s" target="_blank">www.addsearch.com</a> ja kirjaudu palveluun, johon tarvitset sähköpostin ja tämän WordPress-sivuston osoitteen.

source: Open the confirmation e-mail, and from the bottom, copy your Site Key.
fi: Avaa vahvistussähköposti, jonka alareunasta kopioi avainkoodi.

source: Come back to this page in WordPress. Paste your Site Key above and click <strong>Save Changes</strong>.
fi: Tule tälle sivulle takaisin. Liitä avainkoodi ylläolevaan kenttään ja klikkaa <strong>Tallenna muutokset</strong>.

source: Go to <strong>Appearance &rarr; Widgets</strong>. Drag the WordPress native Search Widget to your preferred widget area.
fi: Mene kohtaan <strong>Ulkoasu &rarr; Vimpaimet</strong>. Rahaa WordPressin Haku-vimpain mihin tahansa vimpainalueeseen.

source: If your theme has search somewhere else, it will automatically be replaced by AddSearch.
fi: Jos teemassasi on haku jossakin muualla, niin sekin korvautuu AddSearch-haulla.

source: You're done - congrats! :)
fi: Valmista, onneksi olkoon!

# label
source: Search for:
fi: Haku:

# placeholder
source: Search &hellip;
fi: Haku &hellip;

# submit button
source: Search
fi: Hae
